# Константа числа Пи для выполнения геометрических расчетов
Pi = 3.14159

# Запрос у пользователя значения радиуса через консоль.
# Функция input() считывает текст, а float() преобразует его в вещественное число.
r = float(input("введите радиус: "))

# Запрос у пользователя значения высоты через консоль
h = float(input("Введите высоту: "))

# Расчет объема цилиндра по физической формуле: V = Pi * (r^2) * h
# Оператор ** используется в Python для возведения в степень
V = Pi * (r ** 2) * h

# Вывод результата с округлением вещественной части до 4 знаков после запятой методом .format()
print("{:.4f}".format(V))

